import Button from '@mui/material/Button'
import Link from 'next/link'

const LearningPath = () => {
   return (
      <div className='max-w-3xl rtl mx-auto mt-10 px-4'>
         <h1 className='font-black text-gray-700 text-lg md:text-3xl mb-6 '>
            بهترین نقشه راه زبان انگلیسی وب
         </h1>
         <div className='text-sm text-slate-500 md:text-base'>
            <p className='leading-9'>
               توی این مقاله کوتاه، میخوام خیلی مختصر یه نقشه راه بهت بدم و در نتیجه بر اساس شرایطتت
               متوجه بشی که کدوم یکی از دوره های متخصص فرانت اند، سایت فرانت هوکس، برای شما مناسبه
            </p>
            <p className='mt-8 leading-8'>
               دسته اول: کسایی هستند که تازه میخوان وارد دنیای زبان انگلیسی وب بشن و هدف شون هم اینه
               که بیان سمت فرانت اند. دقت کنید که واقعا مهم نیست که شما چند سالتونه، چه رشته ای
               خوندین و یا قبلا پیش نیازی از زبان انگلیسی دارید یا خیر!
            </p>
            <p className='mt-8 leading-8'>
               پس با این حساب چی مهمه ؟ قطعا توی هر کاری داشتن هدف و مسیر مشخص لازمه. آموزش اصولی در
               یک مسیر مشخص کنار یک مربی با تجربه، تضمین کننده موفقیت شما هست. اما مساله ای که هست
               اینه که اگر در این مسیر جدی نیستید و یا پشتکار لازم رو برای رسیدن به یک درآمد مطلوب
               رو ندارید، پس احتمالا زبان انگلیسی گزینه جالبی برای شما نباشه.
            </p>
            <p className='mt-8 leading-8'>
               شما که ادامه این مطلب رو میخونید، بهتون تبریک میگم! یعنی به اندازه کافی خواهان
               یادگیری هستید و برای یادگیری و سرمایه گذاری روی آینده خودتون ارزش قائل هستید.
            </p>
            <p className='mt-8 leading-8'>
               کسی که برای اولین بار با دنیای زبان انگلیسی داره آشنا میشه، برای شروع فرانت اند اولین
               چیزی که نیاز داره، یاد گیری اصولی HTML CSS هست. مفاهیم پایه CSS فوق العاده مهم هستند
               چون ویترن کار شما در نهایت توسط CSS قضاوت می شود. یعنی در ابتدا باید توانایی پیاده
               سازی قالب های استاتیک فقط به کمک HTML CSS داشته باشید. به همین دلیل اگر در ابتدای راه
               هستید، پیشنهاد من به شما قطعا ثبت نام در
               <Link href='/courses/responsive-web'>
                  &nbsp; دوره طراحی وب رسپانسیو &nbsp;
                  <strong className='text-blue-600 inline-block'></strong>
                  هست که همه آن چیزی که نیاز دارید، از صفر صفر در یک پروژه کاملا واقعی پیاده سازی
                  شده
               </Link>
               است.
            </p>
            <p className='mt-8 leading-8'>
               اگر مفاهیم پایه ای HTML CSS را بلد هستید. در ادامه این مسیر، باید جاوااسکریپت رو
               عمیقا یاد بگیرید. لطفا به هیج وجه، قبل از یادگیری مفاهیم پایه ای جاوااسکریپتی دنبال
               یادگیری کتابخانه ریکت (React.js) و یا Vue.js نروید. چون ابزارهایی مثل React و vue.js
               صرفا کار ما رو ساده تر می کنند و به هیچ عنوان ما رو از مفاهیم جاوااسکریپتی بی نیاز
               نمی کنند. دوستانی که ریکت رو شروع کردند، این حرفم رو خوب در می کنند. از همان جلسات
               اول ریکت، از توابع و مفاهمی جاوااسکریپتی کمک میگیریم تا کامپوننت ها را توسعه بدهیم.
               پس برای چندمین دفعه، تاکید می کنم مفاهیم جاوااسکریپتی رو عمیق یاد بگیرید تا در
               یادگیری ابزارهای جانبی مثل ریکت به مشکل نخورید.
            </p>
            <p className='mt-8 leading-8'>
               نگران نباشید! فکر اینجاشم کردم. دوره جامع و پیشرفته جاوااسکریپت واقعا هیچ پیش نیازی
               از دانش قبلی زبان انگلیسی شما نمی خواهد. همه مطالب و الفبای زبان انگلیسی گفته شده است
               و مطمئن باشید بعد چند سال کار، همچنان این دوره به عنوان مرجع به شما کمک خواهد کرد.
               برای ثبت نام در
               <Link href='/courses/advanced-javascript'>
                  <strong className='text-blue-600'>
                     &nbsp;دوره جامع و پیشرفته جاوااسکریپت &nbsp;
                  </strong>
               </Link>
               کلیک کنید.
            </p>
            <p className='mt-8 leading-8'>
               تا اینجا شما یک برنامه نویس فرانت اند هستید. که میتونید وبسایت ها و وب اپلیکیشن های
               تحت وب رو توسعه بدین. اما ابزارهایی مثل ریکت (React.js)، انگولار (Angular) و Vue.js
               هستند که فوق العاده سرعت توسعه برنامه و عملکرد برنامه رو بهینه می کنند. پس در قدم
               بعدی، انتخاب شما یکی از این سه ابزار هست. تمرکز اصلی خود من روی ریکت هست. به دلیل
               بازارکار زیاد در ایران و خارج از کشور، پشتیبانی غول فیسبوک، جامعه آماری بالا و هم
               چنین سادگی یادگیری. شک نکنید مطالبی که در دوره حرفه ای متخصص ریکت و ریداکس براتون
               آماده کرده ام، حتی در خیلی از دوره های خارجی هم نیست! با خیالت راحت در
               <Link href='/courses/react-course'>
                  <strong className='text-blue-600'>
                     &nbsp; دوره حرفه ای متخصص ریکت و ریداکس &nbsp;
                  </strong>
               </Link>
               ثبت نام کنید.
            </p>
            <p className='mt-8 leading-8'>
               الان دانش شما در زمینه وب به سطح خوبی رسیده، با HTML CSS JS خام کار کردین و درک نسبتا
               خوبی از ریکت پیدا کردین. الان فرصت خوبیه که ابزارهایی رو به کار بگیرید که بتونه به
               صورت بهینه تر و سریع تر کار توسعه رو انجام بدید. یکی از این ابزار ها فریمورک
               تیلوینده. در واقع به ما کمک میکنه CSS اپلیکیشن رو به صورت خیلی سریع، بهینه و رسپانسیو
               و در عین حال کاملا شخصی سازی شده انجام بدین. دوره پروژه محور تیلویند بر اساس UI/UX
               واقعی آماده شده است. بعد این دوره قطعا از سرعت کار خودتون شگفت زده میشید. پس انتخاب
               بعدی شما
               <Link href='/courses/tailwindCSS'>
                  <strong className='text-blue-600'>&nbsp; دوره پروژه محور تیلویند &nbsp;</strong>
               </Link>
               است.
            </p>
            <p className='mt-8 leading-8'>
               زمانی که با ریکت و تیلویند پروژه زدین و کارتون سریع تر شده؛ نیاز مند ارتقای مهارت های
               خودتون هستین. به گونه ای که بتونید پروژه های تجاری رو هم توسعه بدین. پروژه هایی که
               نیاز سئو و عملکرد بالایی هستند. توی همچین مواردی فریمورک Next.js نیازه.
               <Link href='/courses/tailwindCSS'>
                  <strong className='text-blue-600'>&nbsp; دوره متخصص نکست &nbsp;</strong>
               </Link>
               به منظور درک عمیق شما در دو پروژه کاملا واقعی آماده شده است تا تجربه یک پروژه واقعی
               رو داشته باشید.
            </p>
            <p className='leading-8 mt-8'>
               در نهایت باید ذکر کنم که محتوای دوره ها، فقط همین نیست. چون پشتیبانی و مربی محور بودن
               این دوره ها قطعا موفقیت شما رو تضمین می کند. به شرطی که در تصمیم تان جدی هستید و برای
               ارتقا کیفیت زندگی خود و خانواده تان تلاش می کنید، پس می تونیم با هم شروع کنیم.
               <br />
               من<strong> مصطفی تبریزیان </strong>هستم و این دوره های متخصص فرانت اند من هست، خیلی
               خوش آمدید.
            </p>
            <div className='text-center w-full my-8'>
               <Link href='/course'>
                  <Button variant='contained' sx={{borderRadius: '15px', width: '100%', padding: '1rem 0'}}>رفتن به صفحه دوره ها</Button>
               </Link>
            </div>
         </div>
      </div>
   )
}

export default LearningPath
